Grooming/src/Documents/ЗаписьКлиента/ЗаписьКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьКлиента</name>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УслугаОказана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Grooming/src/Documents/ЗаписьКлиента/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ответственный.Пустая() Тогда 
		Объект.Ответственный  = УзнатьТекущегоПользователяКлиент.УзнатьТекущегоПользователя();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
		СтрокаТЧ.Стоимость = РаботаСЦенамиВызовСервера.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Услуга, , Объект.Дата);
	Иначе
		СтрокаТЧ.Стоимость = 0;   
	КонецЕсли;     
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Для Каждого СтрокаТЧ  Из Объект.Услуги Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
			СтрокаТЧ.Стоимость = РаботаСЦенамиВызовСервера.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Услуга, , Объект.Дата);
		Иначе
			СтрокаТЧ.Стоимость = 0;   
		КонецЕсли;     
	КонецЦИкла
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда 
		Если Параметры.Свойство("Начало") Тогда
			Объект.ДатаЗаписи = Параметры.Начало;
		КонецЕсли; 
		
		Если Параметры.Свойство("Окончание") Тогда
			Объект.ДатаОкончанияЗаписи = Параметры.Окончание;
		КонецЕсли;
		
		Если Параметры.Свойство("Сотрудник") Тогда
			Объект.Сотрудник = Параметры.Сотрудник;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(Объект.ДатаЗаписи) Тогда
			Объект.Дата = НачалоДня(Объект.ДатаЗаписи);	
		КонецЕсли;  
		
		УстановитьДоступностьЭлемнтовФормы();
	КонецЕсли;
	
	
	УстановитьДоступностьЭлемнтовФормы();
КонецПроцедуры  

&НаСервере
Процедура УстановитьДоступностьЭлемнтовФормы()
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.УслугаОказана.ТолькоПросмотр = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Записан заказ");
КонецПроцедуры
